// 6 dots braille parameters main no t alter

// dotMap: the dot numbering from x, y coordinates:

// 6-dot Braille numbering
//
//    x: 0 1
// y
// 1     1 4
// 2     2 5
// 3     3 6

languages['6 dots India'] = {
	dotMap: {
		0: {
			0: 1,
			1: 2, 
			2: 3
		},
		1: {
			0: 4,
			1: 5,
			2: 6
		}
	},
	numberPrefix: [3,4,5,6],
	latinToBraille: {
		//"a": [1],
		//"b": [1,2],
		//"c": [1,4],
		//"d": [1,4,5],
		//"e": [1,5],
		//"f": [1,2,4],
		//"g": [1,2,4,5],
		//"h": [1,2,5],
		//"i": [2,4],
		//"j": [2,4,5],
		//"k": [1,3],
		//"l": [1,2,3],
		//"m": [1,3,4],
		//"n": [1,3,4,5],
		//"o": [1,3,5],
		//"p": [1,2,3,4],
		//"q": [1,2,3,4,5],
		//"r": [1,2,3,5],
		//"s": [2,3,4],
		//"t": [2,3,4,5],
		//"u": [1,3,6],
		//"v": [1,2,3,6],
		//"w": [2,4,5,6],
		//"x": [1,3,4,6],
		//"y": [1,3,4,5,6],
		//"z": [1,3,5,6],
		//" ": [],
		
	
		"à": [1, 2, 3,5, 6],
		//"â": [1, 6],
		//"ç": [1,2, 3, 4, 6],
		//"è": [2, 3, 4, 6],
		//"é": [1, 2, 3, 4, 5, 6],
		//"ê": [1, 2, 6],
		//"ë": [1, 2, 4, 6],
		//"î": [1, 4, 6],
		//"ï": [1,2, 4, 5, 6],
		//"ù": [2, 3, 4, 5, 6],
		//"û": [1, 5, 6],
		//"ü": [1, 2, 5, 6],
		
		"ཀ": [1, 3], // Majuscule NatBraille
		"ཁ": [1, 2, 6], // Chiffres NatBraille
		"ག": [1, 2, 4, 5], // need clearification
		"ང": [3, 4, 6],// need clearification
	    "ཅ": [1, 4],// need clearification
		"ཆ": [1, 6],// need clearification
		"ཇ": [2, 4, 5],// need clearification
		"ཉ": [1, 2, 3, 6],// need clearification
		"ཏ": [2, 3, 4, 5],// need clearification
		"ཐ": [1, 4, 5, 6],// need clearification
		"ད": [2, 3, 4, 6],// need clearification
		"ན": [1, 3, 4, 5],// need clearification
		"པ": [1, 2, 3, 4],// need clearification
		"ཕ": [1, 2, 4,],
		"བ": [1, 2],
		"མ": [1, 3, 4],
		"ཙ": [3, 4],
		"ཚ": [1, 2, 4, 5, 6],	
		"ཛ": [1, 3, 5, 6],
		"ཝ": [2, 4, 5, 6],
		"ཞ": [1, 2, 3, 4, 5],
		"ཟ": [1, 3, 4, 6],
		"འ": [1, 5, 6],
		"ཡ": [1, 3, 4, 5, 6],
		"ར": [1, 2, 3, 5],
		"ལ":[1,2,3,],//need special index 
		"ཤ":[1, 4, 6], // need special index 
		"ས":[2, 3, 4], //need special index
		"ཧ": [1, 2, 5],
		"ཨ": [1],	
    }	
}